{
  "version_id": "e37989c8-7bc9-47d0-840c-0a49db10a736",
  "content_id": "18aeae15-a04d-43b7-80e0-2a2162db4002",
  "content": "​ \"The Gates of Morning\" CHAPTER I THE CANOE BUILDER D ICK standing on a ledge of coral cast his eyes to the South. Behind him the breakers of the outer sea thundered and the spindrift scattered on the wind; before him stretched an ocean calm as a lake, infinite, blue, and flown about by the fishing gulls—the lagoon of Karolin. Clipped by its forty-mile ring of coral this great pond was a sea in itself, a sea of storm in heavy winds, a lake of azure, in light airs—and it was his—he who had landed here only yesterday. Women, children, youths, all the tribe to be seen busy along the beach in the blazing sun, fishing with nets, playing their games or working on the paraka patches, all were his people. His were the canoes drawn up on the sand and his the empty houses where the war canoes had once rested on their rollers. Then as he cast his eyes from the lagoon to the canoe houses his brow contracted, and, turning his back to the lagoon he stood facing the breakers on the outer beach and the northern sea. Away there, ​ beyond the sea line, invisible, lay Palm Tree, an island beautiful as a dream, yet swarming with devils. Little Tari the son of Le Taioi the net maker, sitting on the coral close by, looked up at him. Tari knew little of life, but he knew that all the men of Karolin swept away by war had left the women and the boys and the children like himself defenceless and without a man or leader. Then, yesterday, from the northern sea in a strange boat and with Katafa, the girl who had been blown to sea years ago when out fishing, this strange new figure had come, sent by the gods, so the women said, to be their chief and ruler. The child knew nothing of whom the gods might be nor did he care, alone now with this wonderful new person, and out of earshot of his mother, he put the question direct with all the simplicity of childhood. “Taori,” said little Tari, “who are you?” ( é kamina tai ) Could Dick have answered, would the child have understood the strange words of the strange story Dick might have told him? “Tari, I come of people beyond the world you know. My name is Dick Lestrange, and when I was smaller than you, Tari, I was left alone with an old sailor man on that island you call Marua (Palm Tree), which lies beyond sight fifty miles to the north. There we lived and there I grew to be a boy and Kearney, that was his name, taught me to fish and spear fish, and he made for me things to play with, little ships unlike the canoes of ​ the islands. And then, Tari, one day long ago came Katafa, the girl who was blown away from here in a storm. She",
  "version_number": 1,
  "timestamp": "2025-06-18T21:00:03.853758",
  "author": "writer_agent",
  "changes": [
    "Initial version"
  ],
  "metadata": {
    "title": "Content 20250618_210003",
    "description": "",
    "tags": [],
    "source_url": null
  },
  "parent_version": null,
  "status": "draft"
}